{"pages":[{"title":"瓜皮型嚶花庄雀魂赛事","text":"瓜皮型嚶花庄雀魂赛事·创立史瓜皮型嚶花庄雀魂赛事·参赛须知瓜皮型嚶花庄雀魂赛事·比赛日程瓜皮型嚶花庄雀魂赛事·历届赞助清单开赛员培训手册瓜皮型嚶花庄雀魂赛事·直播間A瓜皮型嚶花庄雀魂赛事·直播間B 第一届瓜皮型嚶花庄雀魂赛事·比赛记录第一轮和第二轮第二届瓜皮型嚶花庄雀魂赛事·比赛记录第三轮，第四轮，第五轮，第六轮第三届瓜皮型嚶花庄雀魂赛事·比赛记录 赞助清单感谢下列赞助商对本赛事的大力支持历届赞助清单 参赛公会相关资料总群（水群）472802559 下届人数说明： 3/5的参赛者必须是该公会成员 备注： 1：报名人员请先加大群2：请务必不要一人多役同时加入多个公会","path":"index.html","date":"04-11","excerpt":""},{"title":"404","text":"","path":"404/index.html","date":"04-11","excerpt":""},{"title":"创立史","text":"主办人KKSK于2018年12月10日被公会”我们马娘在续前缘”收留。 于2019年2月发现团友的麻将同好，举办了第一届瓜皮型嚶花庄雀魂赛事。 第一届一开始为24人个人循环赛，然而我忘了给自己报名，故而没机会参赛。 后来陆陆续续又募集到8个好友。 以个人赛成绩1-8，9-16，17-24，新8人做区间，每队随机从这四个区间抽选，组成8组每队4人共32人的团体赛。 采用一次淘汰制。 于2019年3月举行第二届 第二届则跨大了人数 一开始其实是和上次一样的8组每队4人共32人的团体赛。 但我又忘了把自己算上，加上还有其他有兴趣的好友，最後改為8组每队5人共40人的团体赛。 此次比赛为四巡团体积分循环赛。 hatsune于2019年3月3日星期一联系上我，一起组织NGA论坛的公主连结公会团体赛。 于2019年4月预定举行第三届 此次比赛经过多次讨论，决定为双败淘汰制。组成32组每队5人共160人的团体赛。 本WIKI页面也是这一届开始设立。 参赛资格继承制也是这一届开始采用。","path":"History/index.html","date":"04-12","excerpt":""},{"title":"开赛员培训手册","text":"利用大鳳林輔助舉辦雀魂團體賽 管理员培训修订版 作者：蘭子KKSK 目的進行一個32人8組每組4人的雀魂團體賽。 分兩組，第1組和第2組。打兩輪。起始點數為100000。每人進行兩次半莊。 第1輪 第1組打完第1輪，決定1，2，3，4名。 第2組打完第1輪，決定1，2，3，4名。 第2輪 第1組1，2名對局第2組1，2名。 第1組3，4名對局第2組3，4名。 （注意這裡的＂組＂＂輪＂等量詞） 添加書籤 以Chrome 為例子添加書籤 chrome://bookmarks/ 添加URL javascript:void((function(){var e = document.createElement(&apos;script&apos;);e.setAttribute(&apos;src&apos;, &apos;https://lietxia.github.io/maj/dhs.js&apos;);document.body.appendChild(e);})()); 添加队员方法1：後台添加 其他管理 → 查看全部組別信息 → 点击队伍名 方法2：登入添加 http://000.mk/?cid=賽事ID 登入，輸入創建隊伍時的密碼 大鳳林javascript 輔助腳本介紹開啟新標籤頁打開之前創的書籤點擊OK 後，會看到下圖： 在這個畫面再次開啟之前創的書籤，會跳轉至雀魂賽事後台。下面有大鳳林javascript 輔助腳本。 登入自己的雀魂帳號在下方的大鳳林javascript 輔助腳本輸入賽事ID，回合，日期，賽事密碼，並且點擊右邊的重載數據。 讀取牌普上一步驟腳本所能自動填寫的技城分數來源於這一步驟所讀取的牌普。讀取的數據會上傳至大鳳林作者小模的服務器，並顯示在大鳳林網站上。 點擊腳本的『讀取牌普』即可。待腳本將牌普讀取完畢，右邊會出現牌普信息，點擊發送後，會出現發送完畢的消息。 開始對局參賽選手全準備好之後點擊開始某個組 選擇所要開始對局的組，將會顯示要開始對局的選手，以及所繼承的分數。 點擊開始之後腳本會替操盤手自動添加選手，並且自動填寫繼承的分數。代腳本結束動作，操盤手只需要填寫標籤，並點擊雀魂後台的『對局開始』即可。","path":"Admin_Handbook/index.html","date":"04-11","excerpt":""},{"title":"","text":"","path":"Icon/index.html","date":"04-11","excerpt":""},{"title":"瓜皮型嚶花庄雀魂赛事","text":"瓜皮型嚶花庄雀魂赛事·创立史瓜皮型嚶花庄雀魂赛事·参赛须知瓜皮型嚶花庄雀魂赛事·比赛日程瓜皮型嚶花庄雀魂赛事·历届赞助清单开赛员培训手册瓜皮型嚶花庄雀魂赛事·直播間A瓜皮型嚶花庄雀魂赛事·直播間B 第一届瓜皮型嚶花庄雀魂赛事·比赛记录第一轮和第二轮第二届瓜皮型嚶花庄雀魂赛事·比赛记录第三轮，第四轮，第五轮，第六轮第三届瓜皮型嚶花庄雀魂赛事·比赛记录 赞助清单感谢下列赞助商对本赛事的大力支持历届赞助清单 参赛公会相关资料总群（水群）472802559 下届人数说明： 3/5的参赛者必须是该公会成员 备注： 1：报名人员请先加大群2：请务必不要一人多役同时加入多个公会","path":"Home/index.html","date":"04-12","excerpt":""},{"title":"参赛须知","text":"比赛日程 参赛方法 公会列表：https://psc2350.github.io/pcr.mahjong.hexo 赛事 QQ 总群：472802559 瓜皮型嚶花庄雀魂赛事是公开的比赛，只要玩PCR的都可以参赛。比赛由 32 支队伍組成，报名需要以团体名义报名。 本比赛有两种参赛方法： 以个人名义参赛 自行联系各队队长，加入已有团体参赛名额的队伍。 以团队名义报名 以公会名义组成的队伍，且只有一队代表自己公会的，5人中最少需要有3名公会内成员 以公会名义组成的队伍，且有复数队代表自己公会的，5人中最少需要有4名公会内成员 以散人名义组成的队伍，5人中最少需要有3名是PCR玩家。 上一届赛事参赛者有保留名额的资格。若是上一届赛事参赛者皆决定继续参赛，每新一届赛事会允许几支新的队伍报名。新队伍会在该届开始前，与上一届最早被淘汰的几只队伍进行对局，争夺该届报名资格。每支队伍各派五人，以各队伍所派的五人合计总得分统计。不限制替补的数量，但一轮比赛只允许最多两名替补上场。 比赛时间- 只在周六，周日进行。 - 共 5 天：半决赛和决赛是双半庄，其余都是半庄。 -------- 单半庄对局午后场 先锋战：北京时间下午１２点 次锋战：北京时间下午 １点 中堅战：北京时间下午 ２点 副将战：北京时间下午 ３点 大将战：北京时间下午 ４点 -------- 单半庄对局晚间场 先锋战：北京时间下午 ６点 次锋战：北京时间下午 ７点 中堅战：北京时间下午 ８点 副将战：北京时间下午 ９点 大将战：北京时间下午１０点 -------- 双半庄对局 先锋战：北京时间下午 １点 次锋战：北京时间下午 ３点 中堅战：北京时间下午 ５点 副将战：北京时间下午 ７点 大将战：北京时间下午 ９点 关于缺席允许临时更改出场顺序。严禁重复出场。若出现没人可上场的情况（如大将战时大将缺席），则罚24000点，他家每队赏8000点，且只允许当场比赛得点最低的成员代为出场（重复出场的唯一例外）。请参赛者在对局前一小时不参预任何匹配场或友人场，并提前15分钟在赛事房间点击”准备比赛”，人数一到齐就直接开始对局。若开始比赛后遇到网络突发问题，请及时与主办方联系暂停对局，与此同时掉线所带来的损失，将由参赛者自己负责。 比赛规则 本次比赛是单半庄和双半庄合并制，基本上除了半决赛和决赛是双半庄，其余都是半庄。 将以队伍内总得分统计，采用分数继承制。即次锋继承先锋得分。 随机坐席 3赤 默认初始点数：100000 1位必要点数：100000 有 食断 有 便捷提示 有 流局满贯 无 切上满贯 无 击飞 有 表宝牌 有 里宝牌 有 杠表宝牌 无 杠表宝牌即开 有 杠里宝牌 有 四风连打流局 有 四杠散了流局 有 四家立直流局 有 九种九牌流局 无 三家和了流局 无 头跳 有 和了连庄 无 和了终局 有 听牌连庄 无 听牌终局 有 一发 有 南入/西入 有 禁用多倍役满 游戏规则 本次比赛为双败淘汰制。双败淘汰制是一种竞赛形式，与普通的淘汰制输给一个对手即被淘汰不同，参赛者只有输给两个对手才被淘汰。双败淘汰制的比赛一般分胜者组与败者组。在第一轮比赛后，获胜者编入胜者组，失败者编入败者组。之后的每一轮，胜者组的失利队伍降入败者组，在败者组中失利的队伍被淘汰。采取每一桌四进二的规则。每一桌的第一位和第二位的队伍晋级。每一桌的第三位和第四位的队伍淘汰。晋级组（上图左）被淘汰的队伍将有机会和其他败阵的队伍在败者组（上图右）进行对局。 比赛进程每一轮败者组的比赛又分为两个阶段。 第一个阶段，由当前败者组中的幸存者相互对阵，负者被淘汰，胜者进入第二个阶段； 第二个阶段，由第一阶段中败者组的胜者对阵刚刚在本轮由胜者组中淘汰下来的选手。 以本次32队参加的双败淘汰制比赛为例： 第一轮比赛 八桌比赛后，各自有16名选手依据结果编入胜者组或败者组 第二轮比赛 胜者组16名选手相互比赛，败者编入败者组 败者组选手在第一阶段先相互比赛，并淘汰掉8名选手 剩下的8名选手再进入第二阶段，与刚在胜者组淘汰到败者组的8名选手比赛，获胜的8名进入第三轮 第三轮比赛 胜者组8名选手相互比赛，败者编入败者组 败者组选手在第一阶段先相互比赛，并淘汰掉4名选手 剩下的4名选手再进入第二阶段，与刚在胜者组淘汰到败者组的4名选手比赛，获胜的4名进入第四轮 第四轮比赛（即败者组决赛） 败者组剩下的这4名选手在第一阶段先淘汰掉2名（已累积二败绩） 剩下2名进入第二阶段，对阵胜者组决赛中的失败者 败者组决赛中的胜者（到此仅败过1场）将与胜者组决赛中的胜者（到此从未败过），争夺最后的冠军。 在胜者组第一二名与败者组第一二名最后决赛时，任何一方胜利即获得最终的冠军 比赛奖励每届比赛都会募集赞助商，请联系KKSK（QQ:1165746506）。不玩PCR的参赛者没额外奖励。 注意事项本次比赛目的是为了参赛者或是公会之间的交流。若出现一人代打多个账号的分身行为，一经发现（可以通过举报）并证据确凿，将立即取消该队伍资格且当局比赛成绩无效。望各位自律的同时，队长和公会会长也多监督。","path":"Participant_Handbook/index.html","date":"04-11","excerpt":""},{"title":"比赛日程","text":"比赛时间- 只在周六，周日进行。 - 共 5 天：半决赛和决赛是双半庄，其余都是半庄。 -------- 单半庄对局午后场 先锋战：北京时间下午１２点 次锋战：北京时间下午 １点 中堅战：北京时间下午 ２点 副将战：北京时间下午 ３点 大将战：北京时间下午 ４点 -------- 单半庄对局晚间场 先锋战：北京时间下午 ６点 次锋战：北京时间下午 ７点 中堅战：北京时间下午 ８点 副将战：北京时间下午 ９点 大将战：北京时间下午１０点 -------- 双半庄对局 先锋战：北京时间下午 １点 次锋战：北京时间下午 ３点 中堅战：北京时间下午 ５点 副将战：北京时间下午 ７点 大将战：北京时间下午 ９点 晋级组 项目 对战日期 场次 32进16 当月第一个星期六 单半庄对局午后场 16进8 当月第一个星期六 单半庄对局晚间场 8进4 当月第一个星期日 单半庄对局午后场 4进2 当月第二个星期六 双半庄对局 决赛 当月第三个星期六 双半庄对局 败者组 项目 对战日期 场次 第一阶段 16进8 当月第一个星期六 单半庄对局晚间场 第二阶段 16进8 当月第一个星期日 单半庄对局午后场 第一阶段 8进4 当月第一个星期日 单半庄对局晚间场 第二阶段 8进4 当月第二个星期六 单半庄对局午后场 第一阶段 4进2 当月第二个星期六 单半庄对局晚间场 第二阶段 4进2 当月第二个星期日 双半庄对局 决赛 当月第三个星期六 双半庄对局","path":"Schedule/index.html","date":"04-11","excerpt":""},{"title":"历届赞助清单","text":"第一届瓜皮型嚶花庄雀魂赛事 项目 赞助商 (QQ) 赞助内容 获奖者 (QQ) 个人赛冠军 Ky (863469056) PCR游戏内购1单 朝比奈心美 (542404279) 团体赛冠军 KKSK (1165746506) PCR月卡1张 萝莉保护协会 团体赛冠军 Hudson (156563938) PCR月卡1张 萝莉保护协会 团体赛冠军 志希 (1485835862) PCR月卡1张 萝莉保护协会 团体赛冠军 推推 (809551167) PCR月卡1张 萝莉保护协会 第二届瓜皮型嚶花庄雀魂赛事 项目 赞助商 (QQ) 赞助内容 获奖者 (QQ) 团体赛冠军 朱雀 (398095030) PCR月卡4张 龙，1000点 团体赛冠军 志希 (1485835862) PCR月卡1张 龙，1000点 团体赛亚军 Sin(∩´∀｀)∩ (405851887) PCR探索包3张 草 团体赛亚军 志希 (1485835862) PCR探索包2张 草 *本届赞助商Sin(∩´∀｀)∩个人淘宝店：樱凛小屋 第三届瓜皮型嚶花庄雀魂赛事 项目 赞助商 (QQ) 赞助内容 获奖者 (QQ) 团体赛冠军 NGA论坛版主 (752212585) PCR月卡5张 平均打点最高者 ★冷风秋月☆ (294257659) PCR探索包1张 最高打点和了者 ★冷风秋月☆ (294257659) PCR探索包1张 单次半庄最高得分者 ★冷风秋月☆ (294257659) PCR探索包1张 立直和了次数最多者 ★冷风秋月☆ (294257659) PCR探索包1张 最出色和牌* ★冷风秋月☆ (294257659) PCR探索包1张 *此项目存在主观判断，将由主办方和开赛员团队讨论决定。","path":"Sponsors/index.html","date":"04-11","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"04-11","excerpt":""}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2019/04/11/hello-world/","date":"04-11","excerpt":"","tags":[]}]}